---
title: SpatialElementBoundarySubface
classe: Autodesk.Revit.DB.SpatialElementBoundarySubface
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# SpatialElementBoundarySubface

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `spatialElementBoundarySubface.IsValidObject` | Boolean |
| `LinkElementId SpatialBoundaryElement { get; }` | `spatialElementBoundarySubface.SpatialBoundaryElement` | LinkElementId |
| `Boolean SubfaceArisesFromElementFace { get; }` | `spatialElementBoundarySubface.SubfaceArisesFromElementFace` | Boolean |
| `SubfaceType SubfaceType { get; }` | `spatialElementBoundarySubface.SubfaceType` | SubfaceType |
| `Boolean Valid { get; }` | `spatialElementBoundarySubface.Valid` | Boolean |
| `Void Dispose()` | `spatialElementBoundarySubface.Dispose()` | Void |
| `Face GetBoundingElementFace()` | `spatialElementBoundarySubface.GetBoundingElementFace()` | Face |
| `Face GetSpatialElementFace()` | `spatialElementBoundarySubface.GetSpatialElementFace()` | Face |
| `Face GetSubface()` | `spatialElementBoundarySubface.GetSubface()` | Face |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```